<?php

use Illuminate\Database\Seeder;

class LocationTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $locations = [
            [
                'user_id' => 2,
                'title' => 'Замок Любарта',
                'text' => "Замок Любарта, або Луцький замок — верхній замок Луцька, один із двох (частково) збережених замків міста, пам'ятка архітектури та історії національного значення. Один з найбільших, найдавніших і найкраще збережених в Україні замків. Головний об'єкт історико-культурного заповідника «Старий Луцьк», культурний осередок та найстаріша споруда Луцька.",
                'marker' => '{"lat":50.738895,"lng":25.3211282}'
            ],
            [
                'user_id' => 1,
                'title' => 'Варшава',
                'text' => "Варшава (пол. Warszawa) — столиця Польщі з 1596 року, порт на річці Вісла, адміністративний центр Мазовецького воєводства. Місто є місцем розташування центральних органів влади Республіки Польща, іноземних місій, штаб-квартир значної кількості підприємств та громадських об'єднань, що працюють в Польщі.",
                'marker' => '{"lat":52.2330269,"lng":20.7810075}'
            ]
        ];
        DB::table('locations')->insert($locations);
    }
}
